Link to dataset: https://buff.ly/3EtASMF

In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv('https://buff.ly/3EtASMF')
df

         Unnamed: 0       Id     Name  Year Gender State  Count
0             11349    11350     Emma  2004      F    AK     62
1             11350    11351  Madison  2004      F    AK     48
2             11351    11352   Hannah  2004      F    AK     46
3             11352    11353    Grace  2004      F    AK     44
4             11353    11354    Emily  2004      F    AK     41
...             ...      ...      ...   ...    ...   ...    ...
1016390     5647421  5647422     Seth  2014      M    WY      5
1016391     5647422  5647423  Spencer  2014      M    WY      5
1016392     5647423  5647424     Tyce  2014      M    WY      5
1016393     5647424  5647425   Victor  2014      M    WY      5
1016394     5647425  5647426   Waylon  2014      M    WY      5

[1016395 rows x 7 columns]

In [3]:
df.shape

(1016395, 7)

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1016395 entries, 0 to 1016394
Data columns (total 7 columns):
 #   Column      Non-Null Count    Dtype
---  ------      --------------    -----
 0   Unnamed: 0  1016395 non-null  int64
 1   Id          1016395 non-null  int64
 2   Name        1016395 non-null  object
 3   Year        1016395 non-null  int64
 4   Gender      1016395 non-null  object
 5   State       1016395 non-null  object
 6   Count       1016395 non-null  int64
dtypes: int64(4), object(3)
memory usage: 54.3+ MB

In [6]:
df.nunique()

Unnamed: 0    1016395
Id            1016395
Name            17632
Year               11
Gender              2
State              51
Count            1949
dtype: int64

In [7]:
df.duplicated().sum()

0

In [8]:
df.isnull().sum()

Unnamed: 0    0
Id            0
Name          0
Year          0
Gender        0
State         0
Count         0
dtype: int64

In [10]:
df.describe().T

,count,mean,std,min,25%,50%,75%,max
Unnamed: 0,1016395.0,2.830990e+06,1.652476e+06,11349.0,1317326.5,2811920.0,4242554.5,5647425.0
Id,1016395.0,2.830991e+06,1.652476e+06,11350.0,1317327.5,2811921.0,4242555.5,5647426.0
Year,1016395.0,2.009053e+03,3.138293e+00,2004.0,2006.0,2009.0,2012.0,2014.0
Count,1016395.0,3.485012e+01,9.739735e+01,5.0,7.0,11.0,26.0,4167.0

In [11]:
df.describe(include = 'O')

           Name   Gender    State
count   1016395  1016395  1016395
unique    17632        2       51
top       Riley        F       CA
freq       1112   558846    76781

### See the first 10 entries.

In [14]:
df.head(10)

   Unnamed: 0     Id      Name  Year Gender State  Count
0       11349  11350      Emma  2004      F    AK     62
1       11350  11351   Madison  2004      F    AK     48
2       11351  11352    Hannah  2004      F    AK     46
3       11352  11353     Grace  2004      F    AK     44
4       11353  11354     Emily  2004      F    AK     41
5       11354  11355   Abigail  2004      F    AK     37
6       11355  11356    Olivia  2004      F    AK     33
7       11356  11357  Isabella  2004      F    AK     30
8       11357  11358    Alyssa  2004      F    AK     29
9       11358  11359    Sophia  2004      F    AK     28

### Delete the columns 'Unnamed: 0' and 'Id'.

In [19]:
df = df.drop(['Unnamed: 0', 'Id'], axis = 1)
df

            Name  Year Gender State  Count
0           Emma  2004      F    AK     62
1        Madison  2004      F    AK     48
2         Hannah  2004      F    AK     46
3          Grace  2004      F    AK     44
4          Emily  2004      F    AK     41
...          ...   ...    ...   ...    ...
1016390     Seth  2014      M    WY      5
1016391  Spencer  2014      M    WY      5
1016392     Tyce  2014      M    WY      5
1016393   Victor  2014      M    WY      5
1016394   Waylon  2014      M    WY      5

[1016395 rows x 5 columns]

### Are there more male or female names in the dataset?

In [5]:
df['Gender'].value_counts()

Gender
F    558846
M    457549
Name: count, dtype: int64

### Group the dataset by name, assign to a variable called names, and sort the dataset by highest to lowest count.

In [21]:
names = df.groupby('Name')['Count'].sum().sort_values(ascending = False).reset_index()
names

             Name   Count
0           Jacob  242874
1            Emma  214852
2         Michael  214405
3           Ethan  209277
4        Isabella  204798
...           ...     ...
17627      Eniola       5
17628    Atlantis       5
17629       Marci       5
17630  Simarpreet       5
17631        Nita       5

[17632 rows x 2 columns]

### How many different names exist in the dataset?

In [22]:
df['Name'].nunique()

17632

### What is the name with most occurrences?

In [27]:
names.head(1)

    Name   Count
0  Jacob  242874

### What is the standard deviation of count of names?

In [28]:
names['Count'].std()

11006.0694678915

### Get a summary of the dataset with the mean, min, max, std and quartiles.

In [29]:
df.describe().round

         Unnamed: 0            Id          Year         Count
count  1.016395e+06  1.016395e+06  1.016395e+06  1.016395e+06
mean   2.830990e+06  2.830991e+06  2.009053e+03  3.485012e+01
std    1.652476e+06  1.652476e+06  3.138293e+00  9.739735e+01
min    1.134900e+04  1.135000e+04  2.004000e+03  5.000000e+00
25%    1.317326e+06  1.317328e+06  2.006000e+03  7.000000e+00
50%    2.811920e+06  2.811921e+06  2.009000e+03  1.100000e+01
75%    4.242554e+06  4.242556e+06  2.012000e+03  2.600000e+01
max    5.647425e+06  5.647426e+06  2.014000e+03  4.167000e+03